12/data/attachments/19bee250bf6b3ec1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e6047ca8-1a63-4f76-ad3e-5ec3ea4a7291</nif:username>
            <nif:friendToBeAdded>Gail_attorney_Friend_43260_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>